In [2]:
import pandas as pd

#### reading various file formats

In [3]:
df_csv = pd.read_csv('../data/iris.csv')

In [4]:
df_csv.head()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
0,5.1,3.5,1.4,0.2,setosa
1,4.9,3.0,1.4,0.2,setosa
2,4.7,3.2,1.3,0.2,setosa
3,4.6,3.1,1.5,0.2,setosa
4,5.0,3.6,1.4,0.2,setosa

In [5]:
df_csv.tail()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm),species
145,6.7,3.0,5.2,2.3,virginica
146,6.3,2.5,5.0,1.9,virginica
147,6.5,3.0,5.2,2.0,virginica
148,6.2,3.4,5.4,2.3,virginica
149,5.9,3.0,5.1,1.8,virginica

In [6]:
df_csv.shape

(150, 5)

In [7]:
type(df_csv)

pandas.core.frame.DataFrame

In [12]:
type(df_csv['sepal_length_(cm)'])

pandas.core.series.Series

In [16]:
type(df_csv['sepal_length_(cm)'].values)

numpy.ndarray

In [17]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 150 entries, 0 to 149
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   sepal_length_(cm)  150 non-null    float64
 1   sepal_width_(cm)   150 non-null    float64
 2   petal_length_(cm)  150 non-null    float64
 3   petal_width_(cm)   150 non-null    float64
 4   species            150 non-null    object
dtypes: float64(4), object(1)
memory usage: 6.0+ KB

In [18]:
df_csv.describe()

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
25%,5.100000,2.800000,1.600000,0.300000
50%,5.800000,3.000000,4.350000,1.300000
75%,6.400000,3.300000,5.100000,1.800000
max,7.900000,4.400000,6.900000,2.500000

In [19]:
df_csv.describe(percentiles= [0.95, 0.99])

,sepal_length_(cm),sepal_width_(cm),petal_length_(cm),petal_width_(cm)
count,150.000000,150.000000,150.000000,150.000000
mean,5.843333,3.057333,3.758000,1.199333
std,0.828066,0.435866,1.765298,0.762238
min,4.300000,2.000000,1.000000,0.100000
50%,5.800000,3.000000,4.350000,1.300000
95%,7.255000,3.800000,6.100000,2.300000
99%,7.700000,4.151000,6.700000,2.500000
max,7.900000,4.400000,6.900000,2.500000

In [24]:
df_text = pd.read_csv('../data/OnlineRetail.txt', sep='\t', encoding='unicode_escape')

In [25]:
df_text.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom

In [30]:
df_ttext = pd.read_table('../data/OnlineRetail.txt', encoding='unicode_escape')

In [31]:
df_ttext.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom

In [37]:
df_ttext.index

RangeIndex(start=0, stop=541909, step=1)

In [33]:
df_json = pd.read_json('../data/movie.json')

In [36]:
df_json.head()

,David Smith,Brenda Peterson,Bill Duffy,Samuel Miller,Julie Hammel,Clarissa Jackson,Adam Cohen,Chris Duncan
Vertigo,4.0,3.0,4.5,NaN,NaN,5.0,3.5,NaN
Scarface,4.5,1.5,5.0,3.5,2.5,4.5,3.0,NaN
Raging Bull,3.0,1.0,NaN,5.0,NaN,4.0,NaN,4.5
Goodfellas,4.5,2.0,4.5,5.0,3.0,2.5,4.5,NaN
The Apartment,1.0,5.0,1.0,1.0,NaN,1.0,1.0,1.5

In [35]:
df_json.index

Index(['Vertigo', 'Scarface', 'Raging Bull', 'Goodfellas', 'The Apartment',
       'Roman Holiday'],
      dtype='object')

In [43]:
import sqlite3

connection = sqlite3.connect('../data/flights.db')

query = '''SELECT name FROM airlines LIMIT 15'''

df_sql = pd.read_sql_query(query, connection)

In [46]:
pd.read_sql_query('SELECT * FROM routes LIMIT 5', connection)

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2
1,1,2B,410,ASF,2966,KZN,2990,None,0,CR2
2,2,2B,410,ASF,2966,MRV,2962,None,0,CR2
3,3,2B,410,CEK,2968,KZN,2990,None,0,CR2
4,4,2B,410,CEK,2968,OVB,4078,None,0,CR2